app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        begin
          @task = Task.find(params[:id])

INSERT INTO "tasks" ("name", "description", "due_date", "status", "priority", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
        task = Task.new(task_params)
        if task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "in progress"], ["updated_at", "2023-04-03 13:12:48.264747"], ["id", 2]]
---
        task = Task.find(params[:id])
        if task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
      def destroy
        @task = Task.find(params[:id])
        @task.destroy