app/controllers/users_controller.rb

  def login
    user_params = params.require(:user).permit(:username, :email, :password)

    sql = "username = :username OR email = :email"
    user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first
---
SELECT "users".* FROM "users" WHERE (username = NULL OR email = 'mark@gmail.ccom') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

   def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "markpaul"], ["email", "paul@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-03 11:32:23.208462"], ["updated_at", "2023-04-03 11:32:23.208462"]]